#pragma once

#include "Vector3.h"

// ќбъемные концентрации упор€дочены как в статье янгса
// юго-западна€ €чейка из нижнего сло€ €вл€етс€ первой
// северо-восточна€ €чейка из верхнего сло€ последней (27)
// -------------		// ----------------		// ----------------
// | 7 | 8 | 9 |		// | 16 | 17 | 18 |		// | 25 | 26 | 27 |
// -------------		// ----------------		// ----------------
// | 4 | 5 | 6 |		// | 13 | 14 | 15 |		// | 22 | 23 | 24 |
// -------------		// ----------------		// ----------------
// | 1 | 2 | 3 |		// | 10 | 11 | 12 |		// | 19 | 20 | 21 |
// -------------		// ----------------		// ----------------

void define_normal(double *vcon, double dx, double dy, double dz, int material_index, vectors::Vector3 &normal);
